package skypro.java.course1.lesson4;

public class T7_SecondRecipe {
    public static void main(String[] args) {
        /*
        Правила соревнований обновились, и теперь нашему спортсмену нужно сбросить 7 кг,
        чтобы оставаться в своей весовой категории.
        Тренер скорректировал рацион так, чтобы спортсмен мог терять в весе от 250 до 500 грамм в день.
        Посчитайте, сколько дней уйдёт на похудение, если спортсмен будет терять каждый день
        по 250 грамм и сколько, если каждый день будет худеть на 500 грамм.
        Посчитайте, сколько может потребоваться дней в среднем, чтобы добиться результата похудения.
        Результаты всех подсчетов выведите в консоль.
         */
    }
}
